package com.javaex.practice;

public class Ex06 {

	/*
	 
	 아래의 설명중 틀린 것을 찾아서 수정해 보세요.
	 
 	[x] ⦁	변수한개에는 동시에 여러 개의 값을 담을 수 있다.
			*>>변수한개에는 동시에 한가지의 값만 담을 수 있다.
	[x] ⦁	변수는 선언시에 사용한 타입의 값만 저장할 수 있다.
	[x] ⦁	변수는 초기값이 저장되지 않아도 읽을 수 있다.
			*>>초기값이 저장되어있지않다면 읽을수 없다.
	[x] ⦁	모든 자료형의 변수는 동일한 방식으로 저장된다. 
			*>>각각 다른 방식으로 저장된다.
			정수:byte,short,int,long / 실수:double,float / 문자형:char / 논리형:boolean 
	[x] ⦁	double형은 flaot보다 큰 수를 담을 수 있다.
			*>>더 큰수를 담는다는 개념보다는, 더 긴수를 담을수 있다는 개념이 맞다.
	[x] ⦁	int, float, char, String은 모두 기본자료형에 속한다
			*>>String은 자료형이 아니다.
	[x] ⦁	final로 선언된 변수는 수정이 가능하다
			*>>final로 선언된 변수는 변경할수없는 고정된 데이터이다. 값은 선언시에만 저장이 가능하다.
	[0] ⦁	long형은 항상 L을 붙여서 대입해야한다.
	[0] ⦁	float형은 항상 F을 분여서 대입해야한다.

	 
	 
	 
	*/
	
}
